In [4]:
#From List of list
import pandas as pd
data=[
    ["Neha",27],
    ["Mukul",28]
]
df=pd.DataFrame(data,columns=["Name","Age"])
print(df)

    Name  Age
0   Neha   27
1  Mukul   28

In [13]:
#From Dictionay Of Key As Column Name And list As Value
data2={"Name":["Mukul","Neha"],"Age":[28,27]}
df2=pd.DataFrame(data2)
print(df2)

    Name  Age
0  Mukul   28
1   Neha   27

In [16]:
#from numpy arrays
import numpy as np
data3=np.array([[1,2],[3,4]])
df3=pd.DataFrame(data3,columns=["A","B"])
print(df3)

   A  B
0  1  2
1  3  4

In [19]:
pd.read_csv("Data.csv")

    Name  Age
0  Mukul   28
1   Neha   27
2  Ankur   32

In [21]:
pd.read_csv("Data.csv",usecols=["Name"])

    Name
0  Mukul
1   Neha
2  Ankur

In [22]:
pd.read_excel("Data.xlsx")

    Name  Age
0  Mukul   28
1   Neha   27
2  Ankur   32

In [26]:
pd.read_json("Data2.json")

    Name  Age
0  Mukul   28
1   Neha   27

In [31]:
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv"
df=pd.read_csv(url)

In [32]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [33]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [36]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [39]:
df.shape

(244, 7)

In [40]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')